In [ ]:
Nurshanov Dias IT3-2208
python 7 lab

In [49]:
Create a results table (order by the count of gold medals) of Summer Olympic Games in the particular years: 1912,1972,2000 
with respect to the medals type and country.
1) join medals and ioc_codes 
2) 1912,1972,2000
3) order count of gold medals

zsh:1: number expected

In [50]:
import pandas as pd
editions = pd.read_csv("Summer Olympic medalists 1896 to 2008 - EDITIONS.tsv", sep="\t", engine='python')
editions = editions[['Edition', 'Grand Total', 'City', 'Country']]

ioc_codes = pd.read_csv('Summer Olympic medalists 1896 to 2008 - IOC COUNTRY CODES.csv')
ioc_codes = ioc_codes[['Country', 'NOC']]

medals = pd.read_csv('Summer Olympic medalists 1896 to 2008 - ALL MEDALISTS.tsv', sep='\t', header=4)
medals = medals[['Athlete', 'NOC', 'Medal', 'Edition']]

In [51]:
ioc_codes.head()

           Country  NOC
0      Afghanistan  AFG
1          Albania  ALB
2          Algeria  ALG
3  American Samoa*  ASA
4          Andorra  AND

In [52]:
medals.head()

              Athlete  NOC   Medal  Edition
0       HAJOS, Alfred  HUN    Gold     1896
1    HERSCHMANN, Otto  AUT  Silver     1896
2   DRIVAS, Dimitrios  GRE  Bronze     1896
3  MALOKINIS, Ioannis  GRE    Gold     1896
4  CHASAPIS, Spiridon  GRE  Silver     1896

In [53]:
editions.head()

   Edition  Grand Total       City         Country
0     1896          151     Athens          Greece
1     1900          512      Paris          France
2     1904          470  St. Louis   United States
3     1908          804     London  United Kingdom
4     1912          885  Stockholm          Sweden

In [54]:
# 2) 1912,1972,2000
medals = medals[medals['Edition'].isin([1912, 1972, 2000])]
medals = medals.merge(ioc_codes, on='NOC', how='left')


# 1) join medals and ioc_codes 
medals = (
    medals.groupby(['Edition', 'Country', 'Medal'])
    .size()
    .unstack(fill_value=0)
    .reset_index()
)


# 3) order count of gold medals
medals = medals.sort_values(by='Gold', ascending=False)

print(medals[['Edition', 'Country', 'Bronze', 'Gold', 'Silver']])

Medal  Edition              Country  Bronze  Gold  Silver
132       2000        United States      52   130      66
13        1912               Sweden      25    86      62
117       2000               Russia      54    66      68
61        2000            Australia      54    60      69
57        1972        United States      43    53      59
..         ...                  ...     ...   ...     ...
123       2000            Sri Lanka       0     0       1
126       2000               Taiwan       4     0       1
128       2000  Trinidad and Tobago       1     0       1
133       2000              Uruguay       0     0       1
135       2000              Vietnam       0     0       1

[136 rows x 5 columns]